import requests

types = [
    "Консультации и диагностика",
    "Уход за кожей лица",
    "Пилинги",
    "Инъекционная косметология",
    "Аппаратная косметология",
    "Лазерные процедуры",
    "Эстетическая косметология",
    "Косметология тела",
    "Консультации и диагностика",
    "Склеротерапия",
    "Лазерное лечение вен (ЭВЛК)",
    "Минифлебэктомия",
    "Хирургическое лечение",
    "Профилактика и сопровождение",
    "Консультации и диагностика",
    "Консервативное лечение лимфостаза",
    "Аппаратная лимфодренажная терапия",
    "Ручной лимфодренажный массаж",
    "Профилактика и ведение пациентов",
    "Малые гинекологические процедуры",
    "Консультации и диагностика",
    "Лабораторная диагностика",
    "Профилактика и уход за женским здоровьем",
    "Лечение воспалительных и инфекционных заболеваний",
    "Гормональное здоровье и менструальный цикл",
    "Гинекологическая эндокринология",
    "Планирование беременности",
    "Малые гинекологические процедуры",
    'Консультации и диагностика',
]

url = "http://37.230.112.207:8000/service_types/"
token = 'eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJ0b2tlbl90eXBlIjoiYWNjZXNzIiwiZXhwIjoxNzQ4ODYyODUyLCJpYXQiOjE3NDg4NTkyNTIsImp0aSI6ImE5Nzg5NTM5YzY4MDQ2MGZiZjQ4YTczNjNlMmI0ZjZjIiwidXNlcl9pZCI6MX0.ke6r82xSvj-Ae5e9Uajx7lMqj4SAPPS3QV3YHtDInaY'
for type in types:
    data = {
        "name": type
    }
    headers = {
        'Authorization': f'Bearer {token}'
    }
    response = requests.post(url, json=data, headers=headers)
    print(response.status_code)
    print(response.json())