import requests

types = [
    "Консультации и диагностика",
    "Уход за кожей лица",
    "Пилинги",
    "Инъекционная косметология",
    "Аппаратная косметология",
    "Лазерные процедуры",
    "Эстетическая косметология",
    "Косметология тела",
    "Консультации и диагностика",
    "Склеротерапия",
    "Лазерное лечение вен (ЭВЛК)",
    "Минифлебэктомия",
    "Хирургическое лечение",
    "Профилактика и сопровождение",
    "Консультации и диагностика",
    "Консервативное лечение лимфостаза",
    "Аппаратная лимфодренажная терапия",
    "Ручной лимфодренажный массаж",
    "Профилактика и ведение пациентов",
    "Малые гинекологические процедуры",
    "Консультации и диагностика",
    "Лабораторная диагностика",
    "Профилактика и уход за женским здоровьем",
    "Лечение воспалительных и инфекционных заболеваний",
    "Гормональное здоровье и менструальный цикл",
    "Гинекологическая эндокринология",
    "Планирование беременности",
    "Малые гинекологические процедуры",
    'Консультации и диагностика',
]
url = "http://212.109.219.203:8000"

def get_token():
    data = {
        "username": "admin@admin.admin",
        "password": "admin"
    }
    response = requests.post(url + "/token/", data=data)
    return response.json()["access"]

for type in types:
    data = {
        "name": type
    }
    headers = {
        'Authorization': f'Bearer {get_token()}'
    }
    response = requests.post(url + "/service_types", json=data, headers=headers)
    print(response.status_code)
    print(response.json())